# Create, Read and Write Tables Using Pandas
In this notebook we will go over the basic concepts you need to know to create, read and write a table to disk using pandas.

We will start by importing ```pandas```:

In [1]:
#import pandas
import pandas as pd

# Table Creation

In the following block of code we will create a simple table (3 columns and 5 rows) containing the names of students and their grades in 2 exams.

In [2]:
#Declare the table
exam_results = pd.DataFrame()

#Create columns
exam_results["Student name"] = ["camila", "James", "Nicolas", "Nate", "Luna"]
exam_results["Exam 1"] = [4.7, 3.5, 4.5, 4.0, 3.2]
exam_results["Exam 2"] = [4.5, 4.0, 4.7, 4.1, 4.4]

It is important to notice that each column is created by simply naming the column and specifying a list. In our case we have a column containing strings (**Student name**) and other two containing numbers (**Exam 1** and **Exam 2**)

## Print Tables

If we want to see the table, we just need to call it, see below:

In [3]:
exam_results

  Student name  Exam 1  Exam 2
0       camila     4.7     4.5
1        James     3.5     4.0
2      Nicolas     4.5     4.7
3         Nate     4.0     4.1
4         Luna     3.2     4.4

However, you can print only the first or the last ```N``` rows using the methods ```.head()``` or ```.tail()```, respectively. For example, the following line prints the first 3 rows of the table:

In [4]:
exam_results.head(3)

  Student name  Exam 1  Exam 2
0       camila     4.7     4.5
1        James     3.5     4.0
2      Nicolas     4.5     4.7

And the following line of code prints the last 2 rows of the table:

In [5]:
exam_results.tail(2)

  Student name  Exam 1  Exam 2
3         Nate     4.0     4.1
4         Luna     3.2     4.4

## Write Files to Disk

One of the most common file formats used for store tables is the comma-separated values (csv) file. We can save/write to disk a pandas table in a csv format by simply using the ```.to_csv``` method, see below:

In [6]:
exam_results.to_csv("exam_results.csv")

The previous line of code does not produce any visible output in the Jupyter notebook. However, if you go to the folder where this notebook is, you will find a file called **exam_results.csv**

## Read tables

You can also use pandas to read tables. In the line of code below we read the table we just wrote to disk using the method ```.read_csv()```.

In [7]:
new_table = pd.read_csv("exam_results.csv")
new_table

   Unnamed: 0 Student name  Exam 1  Exam 2
0           0       camila     4.7     4.5
1           1        James     3.5     4.0
2           2      Nicolas     4.5     4.7
3           3         Nate     4.0     4.1
4           4         Luna     3.2     4.4

# Final Words

Those were the basic tools you need to start your journey. Now it is your turn to start coding! Try the following:
* Add one more column to the table ```exam_results```.
* Save the table as an excel file and json file using the methods:
    * ```.to_excel("filename.xlsx")```.
    * ```.to_json("filename.json")```.

* Try reading the tables you just wrote to disk using the methods:
    * ```.read_excel("filename.xlsx", index_col=0)```.
    * ```.read_json("filename.json")```.